In [131]:
import pandas as pd
import numpy as np

### 级联操作
- pd.concat, pd.append

pandas使用pd.concat函数，与np.concatenate函数类似，只是多了一些参数：
```
objs
axis=0
keys
join="outer" / "inner":表示的是级联的方式，outer会将所有的项进行级联（忽略匹配和不匹配），而inner只会将匹配的项级联到一起，不匹配的不级联
ignore_index=False
```

- 匹配级联

In [132]:
df1 = pd.DataFrame(data=np.random.randint(0,100,size=(5,3)),columns=["A","B","C"])
df2 = pd.DataFrame(data=np.random.randint(0,100,size=(5,3)),columns=["A","D","C"])

In [133]:
# 行列索引都一致的级联叫做匹配级联
pd.concat((df1, df2), axis=1)

    A   B   C   A   D   C
0  37  41  28  32  78  52
1  32  94   8  26  54  74
2  90   8   4  25  59  23
3  67  47  88  31  99  40
4  91  15  39  97  46  36

- 不匹配级联
    - 不匹配指的是级联的维度的索引不一致。例如纵向级联时列索引不一致，横向级联时行索引不一致
    - 有2种连接方式：
        - 外连接：补NaN（默认模式）
        - 内连接：只连接匹配的项

In [134]:
pd.concat((df1, df2), axis=0)

    A     B   C     D
0  37  41.0  28   NaN
1  32  94.0   8   NaN
2  90   8.0   4   NaN
3  67  47.0  88   NaN
4  91  15.0  39   NaN
0  32   NaN  52  78.0
1  26   NaN  74  54.0
2  25   NaN  23  59.0
3  31   NaN  40  99.0
4  97   NaN  36  46.0

In [135]:
# inner直把可以级联的级联不能级联不处理
pd.concat((df1, df2), axis=0, join="inner")

    A   C
0  37  28
1  32   8
2  90   4
3  67  88
4  91  39
0  32  52
1  26  74
2  25  23
3  31  40
4  97  36

- 如果想要保留数据的完整性必须使用outer（外连接）

- append函数的使用

In [136]:
df1.append(df2)

    A     B   C     D
0  37  41.0  28   NaN
1  32  94.0   8   NaN
2  90   8.0   4   NaN
3  67  47.0  88   NaN
4  91  15.0  39   NaN
0  32   NaN  52  78.0
1  26   NaN  74  54.0
2  25   NaN  23  59.0
3  31   NaN  40  99.0
4  97   NaN  36  46.0

### 合并操作
- merge与concat的区别在于，merge需要依据某一共同列来进行合并

- 使用pd.merge()合并时，会自动根据两者相同column名称的那一列，作为key来进行合并。

- 注意每一列元素的顺序不要求一致

#### 一对一合并

In [137]:
from pandas import  DataFrame

In [138]:
df1 = DataFrame({
    "employee":["Bob","Jake","Lisa"],
    "group":["Accounting","Engineering","Engineering"],
})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

In [139]:
df2 = DataFrame({
    "employee":["Lisa","Bob","Jake"],
    "hire_date":[2004,2008,2012],
})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012

In [140]:
pd.merge(df1, df2, on="employee")

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004

#### 一对多合并

In [141]:
df3 = DataFrame({
    "employee":["Lisa","Jake"],
    "group":["Accounting","Engineering"],
    "hire_date":[2004,2016]
})
df3

  employee        group  hire_date
0     Lisa   Accounting       2004
1     Jake  Engineering       2016

In [142]:
df4 = DataFrame({
    "group":["Accounting","Engineering","Engineering"],
    "supervisor":["Carly","Guido","Steve"]
})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2  Engineering      Steve

In [143]:
# on如果不写，默认情况下使用两表中公有的列作为合并条件
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0     Lisa   Accounting       2004      Carly
1     Jake  Engineering       2016      Guido
2     Jake  Engineering       2016      Steve

#### 多对多合并

In [144]:
df1 = DataFrame({
    "employee":["Bob","Jake","Lisa"],
    "group":["Accounting","Engineering","Engineering"]
})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

In [145]:
df5 = DataFrame({
    "group":["Engineering","Engineering","HR"],
    "supervisor":["Carly","Guido","Steve"]
})
df5

         group supervisor
0  Engineering      Carly
1  Engineering      Guido
2           HR      Steve

In [146]:
pd.merge(df1, df5, how="right")

  employee        group supervisor
0     Jake  Engineering      Carly
1     Lisa  Engineering      Carly
2     Jake  Engineering      Guido
3     Lisa  Engineering      Guido
4      NaN           HR      Steve

In [147]:
pd.merge(df1,df5,how="left")

  employee        group supervisor
0      Bob   Accounting        NaN
1     Jake  Engineering      Carly
2     Jake  Engineering      Guido
3     Lisa  Engineering      Carly
4     Lisa  Engineering      Guido

#### key的规范化

- 当两张表没有可进行连接的列时，可使用left_on和right_on手动指定merge中左右两边的哪一列列作为连接的列

In [148]:
df1 = DataFrame({
    "employee":["Bobs","Linda","Bill"],
    "group":["Accounting","Product","Marketing"],
    "hire_date":[1998,2017,2018]
})
df1

  employee       group  hire_date
0     Bobs  Accounting       1998
1    Linda     Product       2017
2     Bill   Marketing       2018

In [149]:
df5 = DataFrame({
    "name":["Lisa","Bobs","Bill"],
    "hire_dates":[1998,2016,2007]
})
df5

   name  hire_dates
0  Lisa        1998
1  Bobs        2016
2  Bill        2007

In [150]:
pd.merge(df1,df5,left_on="employee",right_on="name")

  employee       group  hire_date  name  hire_dates
0     Bobs  Accounting       1998  Bobs        2016
1     Bill   Marketing       2018  Bill        2007

#### 内合并与外合并:out取并集 inner取交集

In [151]:
df6 = DataFrame({
    "name":["Peter","Paul","Mary"],
    "food":["fish","beans","bread"]
})
df7 = DataFrame({
    "name":["Mary","Joseph"],
    "drink":["wine","beer"]
})

In [152]:
# out取并集 inner取交集
pd.merge(df6,df7,how="outer",on="name")

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [153]:
pd.merge(df6,df7,how="inner",on="name")

   name   food drink
0  Mary  bread  wine